src/templates/node/test/stress.yml
# Stress test for __serviceName__

config:
  target: '__reverseProxy__:__port__'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
    - get:
        url: "__baseURL__/apidoc"
    - get:
        url: "__baseURL__/coverage"
    - get:
        url: "__baseURL__/test"

# expect 400
    - get:
        url: "__baseURL__/un-matched"

# Acm routes
############
    - post:
        url: "__baseURL__/acm"
        json:
          "subject": "5cee730bb2820d47582e9abd"
          "accessControl":
              "read": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
              "update": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
              "delete": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
        capture:
          - json: $._id
            as: "idAcm"

# expect 400
    - post:
        url: "__baseURL__/acm"
        json:
          "accessControl":
              "read": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
              "update": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
              "delete": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
    - get:
        url: "__baseURL__/acm"
    - get:
        url: "__baseURL__/acm?page=2"
    - get:
        url: "__baseURL__/acm?_id={{idAcm}}"
# expect 400
    - get:
        url: "__baseURL__/acm?_id=wrongFormat"
    - put:
        url: "__baseURL__/acm?_id={{idAcm}}&operation=pull&target=accessControl.read"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - put:
        url: "__baseURL__/acm?_id={{idAcm}}&operation=push&target=accessControl.read"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - put:
        url: "__baseURL__/acm?_id={{idAcm}}"
        json:
          "subject": "5cee7a0493f93a4e65b32639"
# expect 400
    - put:
        url: "__baseURL__/acm?_id={{idAcm}}&operation=unknown&target=accessControl.read"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "__baseURL__/acm?_id={{idAcm}}&operation=pull&target=accessControl.unknown"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - delete:
        url: "__baseURL__/acm?_id={{idAcm}}"
# expect 400
    - delete:
        url: "__baseURL__/acm?_id={{idAcm}}"
# expect 400
    - delete:
        url: "__baseURL__/acm?_id=wrongFormat"


# Role routes
#############
    - post:
        url: "__baseURL__/role"
        json:
          "name": "Role A"
          "description": "Role A description"
          "members": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
          "accessRoutes": [ "route": "http://sample/route/1", "method": "POST" ]
        capture:
          - json: $._id
            as: "idRole"
# expect 400
    - post:
        url: "__baseURL__/role"
        json:
          "name": "Role A"
          "description": "Role A description"
          "members": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
          "accessRoutes": [ "route": "http://sample/route/1", "method": "UNKNOWN_METHOD" ]
# expect 400
    - post:
        url: "__baseURL__/role"
        json:
          "description": "Role A description"
          "members": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee730bb2820d47582e9abd"]
          "accessRoutes": [ "route": "http://sample/route/1", "method": "POST" ]
    - get:
        url: "__baseURL__/role"
    - get:
        url: "__baseURL__/role?page=2"
    - get:
        url: "__baseURL__/role?_id={{idRole}}"
# expect 400
    - get:
        url: "__baseURL__/role?_id=wrongFormat"
    - put:
        url: "__baseURL__/role?_id={{idRole}}&operation=push&target=members"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - put:
        url: "__baseURL__/role?_id={{idRole}}"
        json:
          "name": "New name"
    - put:
        url: "__baseURL__/role?_id={{idRole}}&operation=pull&target=members"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "__baseURL__/role?_id={{idRole}}&operation=pull&target=unknown"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "__baseURL__/role?_id={{idRole}}&operation=unknown&target=members"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - delete:
        url: "__baseURL__/role?_id={{idRole}}"
# expect 400
    - delete:
        url: "__baseURL__/role?_id={{idRole}}"
# expect 400
    - delete:
        url: "__baseURL__/role?_id=wrongFormat"


# Service routes
################
    - post:
        url: "__baseURL__/service"
        json:
          "name": "Service A"
          "serviceId": "02"
          "routes": [ "route": "http://sample/route/1", "method": "POST", "group": "Company", "name": "Create company", "description": "Create company data"]
        capture:
          - json: $._id
            as: "idService"
# expect 400
    - post:
        url: "__baseURL__/service"
        json:
          "name": "Service A"
          "serviceId": "02"
          "routes": [ "route": "http://sample/route/1", "method": "POST", "group": "Company", "name": "Create company", "description": "Create company data"]
# expect 400
    - post:
        url: "__baseURL__/service"
        json:
          "name": "Service A"
          "serviceId": "02"
          "routes": [ "route": "http://sample/route/1", "method": "POST", "group": "Company", "name": "Create company", "description": "Create company data"]
    - get:
        url: "__baseURL__/service"
    - get:
        url: "__baseURL__/service?page=2"
    - get:
        url: "__baseURL__/service?_id={{idService}}"
# expect 400
    - get:
        url: "__baseURL__/service?_id=wrongFormat"
    - put:
        url: "__baseURL__/service?_id={{idService}}&operation=push&target=routes"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - put:
        url: "__baseURL__/service?_id={{idService}}&operation=pull&target=routes"
        json:
          "name": "newName"
    - put:
        url: "__baseURL__/service?_id={{idService}}"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "__baseURL__/service?_id={{idService}}&operation=pull&target=unknown"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "__baseURL__/service?_id={{idService}}&operation=unknown&target=routes"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - delete:
        url: "__baseURL__/service?_id={{idService}}"
# expect 400
    - delete:
        url: "__baseURL__/service?_id={{idService}}"
# expect 400
    - delete:
        url: "__baseURL__/service?_id=wrongFormat"


# Token routes
##############
    - post:
        url: "__baseURL__/token/create"
        json:
          "userId": "5cee730bb2820d47582e9abd"
        capture:
          - json: $.token
            as: "token"
    - post:
        url: "__baseURL__/token/validate"
        json:
          "route": "http://sample/route/1"
          "method": "PUT"
          "body":
            "one": "one"
          "objectId": "5cee7a0493f93a4e65b32638"
          "token": {{token}}
    - post:
        url: "__baseURL__/token/validate"
        json:
          "route": "http://sample/route/1"
          "method": "DELETE"
          "body":
            "one": "one"
          "objectId": "5cee7a0493f93a4e33b32638"
          "token": {{token}}

# User routes
################
    - post:
        url: "__baseURL__/user"
        json:
          "userId": "sample@gmail.com"
        capture:
          - json: $._id
            as: "idUser"
# expect 400
    - post:
        url: "__baseURL__/user"
        json:
          "userId": "sample@gmail.com"
# expect 400
    - post:
        url: "__baseURL__/user"
        json:
          "userId": "sample@gmail.com"
    - get:
        url: "__baseURL__/user"
    - get:
        url: "__baseURL__/user?page=2"
    - get:
        url: "__baseURL__/user?_id={{idUser}}"
# expect 400
    - get:
        url: "__baseURL__/user?_id=wrongFormat"
    - put:
        url: "__baseURL__/user?_id={{idUser}}"
        json:
          "userId": "sample@gmail.com"
    - delete:
        url: "__baseURL__/user?_id={{idUser}}"
# expect 400
    - delete:
        url: "__baseURL__/user?_id={{idUser}}"
# expect 400
    - delete:
        url: "__baseURL__/user?_id=wrongFormat"